const WorksVideos = [
  {
    fname: "ackermann.mp4",
    poster: "ackermann.png",
    title: "アッカーマンリンク付きラジコン",
    des:
      "自動車のステアリングの基本理論であるアッカーマン･ジャントー機構を用いた独立2輪のラジコンです．学部2年くらいの時にサークルで作りました．懐かしい．\nいつしかmaxonモータ以外のモータを使わなくなってしまった．",
  },
  {
    fname: "pin.mp4",
    poster: "pin.png",
    title: "対戦型ボーリングロボット(ピンロボット)",
    des:
      "とある授業にて数人グループで作りました．2人用対戦型ゲームを想定して，ボール側はピンが多く倒れるように軌道を入力，ピン側はボールの軌道を予測して配置を決めます．2人の入力完了後，同時にスタートさせます．\n僕はピンロボット制御UIとしてのAndroidソフト開発をしました．時間的に追い込まれながらのソフト開発は何とも辛いですね...",
  },
  {
    fname: "ball.mp4",
    poster: "ball.png",
    title: "対戦型ボーリングロボット(ボールロボット)",
    des:
      "こちらのボール型ロボットは設計および制御を担当しました．正直，こんな球形のロボットが上手く走る訳ないやろと思いながら設計していたので，動画のように走った時はめちゃくちゃビックリしました笑",
  },
];

export default WorksVideos;
