const CONTENT = [
  {
    year: "1997",
    title: "生誕",
    text:
      "三島由紀夫さんは生まれた時の記憶があったと言われているらしいですが，僕は小2くらいまでの記憶がほとんどないです...",
    color: "#6cd3f7",
  },
  {
    year: "2004/04 - 2010/03",
    title: "第三小学校",
    text:
      "4年生くらいから塾漬けで泣くほど辛かった記憶があります．\n6年間サッカーやってた記憶もうっすら残っています．",
    color: "#ffbe7e",
  },
  {
    year: "2010/04 - 2016/03",
    title: "南多摩中等教育学校",
    text:
      "1期生でした．\nめちゃくちゃ良い学校でした．\n英語辛かった...\nテニス楽しかった．",
    color: "#9da6f7",
  },
  {
    year: "2016/04 - 2020/03",
    title: "東京工業大学",
    text: "手術ロボットのマスタ開発\nボーリングロボット開発\nYalの開発\netc...",
    color: "#ff8484",
  },
  {
    year: "2019/10 -",
    title: "テックフライヤー株式会社",
    text: "Web開発",
    color: "#1A7FBE",
  },
  {
    year: "2020/04 - ",
    title: "東京工業大学 大学院",
    text: "手術ロボットの半自動化研究",
    color: "#dd9df7",
  },
  {
    year: "2020/10 - 2020/11",
    title: "株式会社リクルート",
    text: "Web開発",
    color: "#37b1de",
  },
  {
    year: "2020/11 - ",
    title: "株式会社松尾研究所",
    text: "ロボットの自動化制御",
    color: "#34495e",
  },
  {
    year: "2020/11 - ",
    title: "リバーフィールド株式会社",
    text: "手術ロボット開発",
    color: "#58c3ff",
  },
];

export default CONTENT;
